# 预测HAMD分数
"""预测HAMD分数"""
import torch
from app.models.hamd_model import load_hamd_model


# ===================== 预测分数=====================
def predict_row_score(text): 
    """预测HAMD原始分数列表"""
    tokenizer = load_hamd_model()[0]
    model = load_hamd_model()[1]
    
    system_prompt = """
    你是严格遵循汉密尔顿抑郁量表17项版本(HAMD-17)临床评分标准的专业智能评分体系。\n请从医生和患者的完整原始对话中,自动提取患者表达的情绪、症状、体验，严格按照以下评分标准为每一项打分，并严格按照要求输出最终的评分结果。\n严格按照以下固定17项顺序、分级评分标准及打分示例执行评分:区分0-4分五级评分、0-2分三级评分两类题目:\n严禁跨分值打分、严禁打乱项次顺序:\n最终仅输出17个数字:以英文逗号分隔:\n无任何文字说明、无空格、无换行、无多余字符:严格匹配输出格式要求。\nHAMD17项评分标准及示例\n1.抑郁情绪(0-4分):0=无抑郁情绪;1=仅询问时诉及抑郁;2=自发表达抑郁情绪;3=表情、语气均流露抑郁;4=持续重度抑郁:完全无法缓解\n2.有罪感(0-4分):0=无自责自罪;1=轻微自责:觉得自己犯错;2=认为自己有过失:应受惩罚;3=存在罪恶妄想;4=罪恶妄想伴幻听谴责\n3.自杀观念(0-4分):0=无自杀想法;1=觉得生活无意义;2=有轻生念头:无具体计划;3=有明确自杀计划;4=实施过自杀行为\n4.入睡困难(0-2分):0=入睡正常;1=偶尔入睡延迟:可自行缓解;2=每晚入睡困难:需较长时间才能入睡\n5.睡眠不深(0-2分):0=睡眠踏实;1=睡眠浅、多梦:易惊醒;2=夜间频繁醒来:睡眠质量极差\n6.早醒(0-2分):0=无早醒;1=早醒后可再次入睡;2=早醒后无法再次入眠:直至天亮\n7.工作和兴趣(0-4分):0=工作、兴趣正常;1=对日常事务兴趣轻微减退;2=兴趣明显减退:不愿参与活动;3=无法坚持工作:活动时长极短;4=完全丧失工作与兴趣:拒绝活动\n8.迟缓(0-4分):0=思维、行动正常;1=思维、动作轻微迟缓;2=言语、动作明显缓慢:反应迟钝;3=交流、动作困难:需引导;4=完全木僵:无自主言语与动作\n9.激越(0-4分):0=无躁动不安;1=轻微坐立不安;2=明显烦躁:难以静坐;3=不停走动、搓手:无法自控;4=重度激越:出现撕扯、拍打等行为\n10.精神性焦虑(0-4分):0=无精神焦虑;1=轻微紧张、担忧;2=明显焦虑:难以平复;3=持续焦虑:伴恐惧情绪;4=惊恐发作:无法控制\n11.躯体性焦虑(0-4分):0=无躯体不适;1=轻微躯体焦虑症状(心慌、胸闷等);2=明显躯体症状:影响日常;3=重度躯体不适:需卧床;4=严重躯体症状:伴功能障碍\n12.胃肠道症状(0-2分):0=胃肠功能正常;1=食欲轻微减退:无其他不适;2=食欲极差:伴腹胀、恶心等症状\n13.全身症状(0-2分):0=无全身不适;1=轻微乏力、酸痛等;2=明显全身乏力、肢体沉重:影响活动\n14.生殖系统症状(0-2分):0=生殖功能正常;1=轻微性欲减退;2=明显性欲减退或性功能障碍\n15.疑病(0-4分):0=无身体不适关注;1=过度关注身体细微不适;2=反复担忧自身患病:反复确认;3=存在疑病妄想:坚信患病;4=疑病妄想伴幻听\n16.体重减轻(0-2分):0=体重无变化;1=轻微体重下降:无刻意减重;2=明显体重减轻:符合临床减重标准\n17.自知力(0-2分):0=完全自知患病:主动求治;1=部分自知:归咎于外界因素:不愿求治;2=完全无自知力:否认患病\n",
    """

    prompt = f"""<|im_start|>system
{system_prompt}<|im_end|>
<|im_start|>user
{text}<|im_end|>
<|im_start|>assistant
"""
    inputs = tokenizer(prompt, return_tensors="pt", truncation=True, max_length=2048).to(device= "cuda") #type: ignore
    with torch.no_grad():
        outputs = model.generate(**inputs, temperature=0.1, do_sample=False, max_new_tokens=60)
    res = tokenizer.decode(outputs[0], skip_special_tokens=True).split("assistant")[-1].strip() #type: ignore
    res = res.replace(" ", "").replace("，", ",")
    return res

# ===================== 解析分数 + 计算总分 + 程度 =====================
def hamd_scores(s):
    """计算HAMD总分 分层"""
    try:
        lst = [int(i.strip()) for i in s.split(",") if i.strip()]
        if len(lst) != 17:
            return None, 0, ""
        total = sum(lst)
        if total <= 7:
            level = "正常或无抑郁"
        elif total <= 17:
            level = "可能存在抑郁（轻度抑郁）"
        elif total <= 24:
            level = "肯定存在抑郁（中度抑郁）"
        else:
            level = "严重抑郁（重度抑郁）"
        return lst, total, level
    except:
        return None, 0, ""
